Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ОстаткиМатериалов.Записывать = Истина;

    Если Склад = Неопределено Тогда
        Отказ = Истина;
        Сообщить("Не указан склад!");
        Возврат;
    КонецЕсли;

    Для Каждого СтрокаМат Из Материалы Цикл

        Если СтрокаМат.Материал = Неопределено Тогда
            Продолжить;
        КонецЕсли;

        Если СтрокаМат.Количество = Неопределено Или СтрокаМат.Количество <= 0 Тогда
            Продолжить;
        КонецЕсли;

        Запись = Движения.ОстаткиМатериалов.Добавить();
        Запись.Период = Дата;
        Запись.ВидДвижения = ВидДвиженияНакопления.Приход;

        Запись.Материал = СтрокаМат.Материал;
        Запись.Склад = Склад;
        Запись.ЕдиницаИзмерения = СтрокаМат.Материал.ЕдиницаИзмерения;
        Запись.Количество = СтрокаМат.Количество;

    КонецЦикла;

КонецПроцедуры
