Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.СтоимостныеПоказатели.Записывать = Истина;

    Если Продукт = Неопределено Тогда
        Отказ = Истина;
        Сообщить("Не указан продукт (продукция)!");
        Возврат;
    КонецЕсли;

    Если ФактическоеКоличество = Неопределено Или ФактическоеКоличество <= 0 Тогда
        Отказ = Истина;
        Сообщить("Фактическое количество должно быть больше 0!");
        Возврат;
    КонецЕсли;
    Если ОбщиеЗатратыНаПроизводство = Неопределено Тогда
        ОбщиеЗатратыНаПроизводство = 0;
    КонецЕсли;

    СебестоимостьЕдиницы = 0;
    Если ФактическоеКоличество <> 0 Тогда
        СебестоимостьЕдиницы = ОбщиеЗатратыНаПроизводство / ФактическоеКоличество;
    КонецЕсли;

    Запись = Движения.СтоимостныеПоказатели.Добавить();
    Запись.Период = Дата;
    Запись.Продукция = Продукт;
    Запись.ЭтапПроизводства = ЭтапПроизводства;

    Запись.Себестоимость = СебестоимостьЕдиницы;
    Запись.ОбщаяСтоимость = ОбщиеЗатратыНаПроизводство;

КонецПроцедуры
