&НаКлиенте
Процедура ПроизводствоПриИзменении(Элемент)

ЗаполнитьМатериалыИзПроизводства();

КонецПроцедуры          

&НаКлиенте
Процедура ЗаполнитьМатериалыИзПроизводства()

    Если Объект.Производство = Неопределено Тогда
        Сообщить("Выберите документ 'Производство'.");
        Возврат;
    КонецЕсли;

    Данные = ПолучитьМатериалыПроизводстваНаСервере(Объект.Производство);

    Объект.Материалы.Очистить();

    Для Каждого СтрДанных Из Данные Цикл
        НоваяСтрока = Объект.Материалы.Добавить();
        НоваяСтрока.Материал = СтрДанных.Материал;
        НоваяСтрока.Количество = СтрДанных.Количество;
    КонецЦикла;

    Элементы.Материалы.Обновить();

КонецПроцедуры

&НаСервере
Функция ПолучитьМатериалыПроизводстваНаСервере(ПроизводствоСсылка) Экспорт

    Результат = Новый Массив;

    Если ПроизводствоСсылка = Неопределено Тогда
        Возврат Результат;
    КонецЕсли;

    Попытка
        ОбъектПроизводство = ПроизводствоСсылка.ПолучитьОбъект();
    Исключение
        Возврат Результат;
    КонецПопытки;


    Для Каждого Стр Из ОбъектПроизводство.Материалы Цикл
        Если Стр.Материал = Неопределено Тогда
            Продолжить;
        КонецЕсли;

        Кол = ?(Стр.Количество = Неопределено, 0, Стр.Количество);

        Результат.Добавить(Новый Структура("Материал,Количество", Стр.Материал, Кол));
    КонецЦикла;

    Возврат Результат;

КонецФункции