Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    // Скажем платформе, что будем писать движения в регистр
    Движения.ОстаткиМатериалов.Записывать = Истина;

    // На всякий случай
    Если Склад = Неопределено Тогда
        Отказ = Истина;
        Сообщить("Не указан склад!");
        Возврат;
    КонецЕсли;

    // Движения по строкам табличной части
    Для Каждого СтрокаМат Из Материалы Цикл

        Если СтрокаМат.Материал = Неопределено Тогда
            Продолжить;
        КонецЕсли;

        Если СтрокаМат.Количество = Неопределено Или СтрокаМат.Количество <= 0 Тогда
            Продолжить;
        КонецЕсли;

        Запись = Движения.ОстаткиМатериалов.Добавить();
        Запись.Период = Дата;
        Запись.ВидДвижения = ВидДвиженияНакопления.Расход;

        Запись.Материал = СтрокаМат.Материал;
        Запись.Склад = Склад;
        Запись.ЕдиницаИзмерения = СтрокаМат.Материал.ЕдиницаИзмерения;
        Запись.Количество = СтрокаМат.Количество;

    КонецЦикла;

КонецПроцедуры
